app/controllers/entry_controller.rb

  def show
    @toilet = Toilet.find(params[:id])
---
SELECT * FROM "toilets" WHERE ("toilets"."id" = 6)