app/controllers/toilets_controller.rb

SELECT * FROM "toilets" WHERE ("toilets"."id" = 1)
---
  def show
    @toilet = Toilet.find(params[:id])

SELECT * FROM "toilets" WHERE ("toilets"."id" = 1)
---
  def edit
    @toilet = Toilet.find(params[:id])

INSERT INTO "toilets" ("name", "updated_at", "venuetype", "toiletlocation", "whocanuse", "howtoaccess", "changingbench", "hoist", "address", "lat", "long", "created_at") VALUES('Place', '2009-06-20 13:17:46', 'venu', 'loc', 'who', 'howto', 'bench', 'hoist', 'some addr', '55.86490890178817', '-4.253425598144531', '2009-06-20 13:17:46')
---
  def create
    @toilet = Toilet.new(params[:toilet])

    respond_to do |format|
      if @toilet.save

SELECT * FROM "toilets" WHERE ("toilets"."id" = 1)
UPDATE "toilets" SET "long" = '-4.265012741088867', "lat" = '55.866450104840006', "updated_at" = '2009-06-20 13:31:02' WHERE "id" = 1
---
  def update
    @toilet = Toilet.find(params[:id])

    respond_to do |format|
      if @toilet.update_attributes(params[:toilet])

SELECT * FROM "toilets" WHERE ("toilets"."id" = 7)
DELETE FROM "toilets" WHERE "id" = 7
---
  def destroy
    @toilet = Toilet.find(params[:id])
    @toilet.destroy